var converter = {
	d: {
		BulgarianToEsperanto: { "А": "A", "Б": "B", "В": "V", "Г": "G", "Д": "D", "Е": "E", "Ж": "Ĵ", "З": "Z", "И": "I", "Й": "J", "К": "K", "Л": "L", "М": "M", "Н": "N", "О": "O", "П": "P", "Р": "R", "С": "S", "Т": "T", "У": "U", "Ф": "F", "Х": "Ĥ", "Ц": "C", "Ч": "Ĉ", "Ш": "Ŝ", "Щ": "ŜT", "Ъ": "Ŭ", "Ю": "JU", "Я": "JA", "а": "a", "б": "b", "в": "v", "г": "g", "д": "d", "е": "e", "ж": "ĵ", "з": "z", "и": "i", "й": "j", "к": "k", "л": "l", "м": "m", "н": "n", "о": "o", "п": "p", "р": "r", "с": "s", "т": "t", "у": "u", "ф": "f", "х": "ĥ", "ц": "c", "ч": "ĉ", "ш": "ŝ", "щ": "ŝt", "ъ": "ŭ", "ь": "j", "ю": "ju", "я": "ja" },
		BulgarianToShavian: { "А": "𐑨", "Б": "𐑚", "В": "𐑝", "Г": "𐑜", "Д": "𐑛", "Е": "𐑧", "Ж": "𐑠", "З": "𐑟", "И": "𐑦", "Й": "𐑢", "К": "𐑒", "Л": "𐑤", "М": "𐑫", "Н": "𐑵", "О": "𐑩", "П": "𐑐", "Р": "𐑮", "С": "𐑕", "Т": "𐑑", "У": "𐑪", "Ф": "𐑓", "Х": "𐑙", "Ц": "𐑔", "Ч": "𐑗", "Ш": "𐑖", "Щ": "𐑖𐑑", "Ъ": "𐑘", "Ю": "𐑢𐑪", "Я": "𐑢𐑨", "а": "𐑨", "б": "𐑚", "в": "𐑝", "г": "𐑜", "д": "𐑛", "е": "𐑧", "ж": "𐑠", "з": "𐑟", "и": "𐑦", "й": "𐑢", "к": "𐑒", "л": "𐑤", "м": "𐑫", "н": "𐑵", "о": "𐑩", "п": "𐑐", "р": "𐑮", "с": "𐑕", "т": "𐑑", "у": "𐑪", "ф": "𐑓", "х": "𐑙", "ц": "𐑔", "ч": "𐑗", "ш": "𐑖", "щ": "𐑖𐑑", "ъ": "𐑘", "ь": "𐑢", "ю": "𐑢𐑪", "я": "𐑢𐑨" },
		CyrillicToEsperanto: { "А": "A", "Б": "B", "Ц": "C", "Ч": "Ĉ", "Д": "D", "Е": "E", "Ф": "F", "Г": "G", "Џ": "Ĝ", "Һ": "H", "Х": "Ĥ", "И": "I", "Ј": "J", "Ж": "Ĵ", "К": "K", "Л": "L", "М": "M", "Н": "N", "О": "O", "П": "P", "Р": "R", "С": "S", "Ш": "Ŝ", "Т": "T", "У": "U", "Ў": "Ŭ", "В": "V", "З": "Z", "а": "a", "б": "b", "ц": "c", "ч": "ĉ", "д": "d", "е": "e", "ф": "f", "г": "g", "џ": "ĝ", "һ": "h", "х": "ĥ", "и": "i", "ј": "j", "ж": "ĵ", "к": "k", "л": "l", "м": "m", "н": "n", "о": "o", "п": "p", "р": "r", "с": "s", "ш": "ŝ", "т": "t", "у": "u", "ў": "ŭ", "в": "v", "з": "z" },
		CyrillicToShavian: { "А": "𐑨", "Б": "𐑚", "Ц": "𐑔", "Ч": "𐑗", "Д": "𐑛", "Е": "𐑧", "Ф": "𐑓", "Г": "𐑜", "Џ": "𐑡", "Һ": "𐑣", "Х": "𐑙", "И": "𐑦", "Ј": "𐑢", "Ж": "𐑠", "К": "𐑒", "Л": "𐑤", "М": "𐑫", "Н": "𐑵", "О": "𐑩", "П": "𐑐", "Р": "𐑮", "С": "𐑕", "Ш": "𐑖", "Т": "𐑑", "У": "𐑪", "Ў": "𐑘", "В": "𐑝", "З": "𐑟", "а": "𐑨", "б": "𐑚", "ц": "𐑔", "ч": "𐑗", "д": "𐑛", "е": "𐑧", "ф": "𐑓", "г": "𐑜", "џ": "𐑡", "һ": "𐑣", "х": "𐑙", "и": "𐑦", "ј": "𐑢", "ж": "𐑠", "к": "𐑒", "л": "𐑤", "м": "𐑫", "н": "𐑵", "о": "𐑩", "п": "𐑐", "р": "𐑮", "с": "𐑕", "ш": "𐑖", "т": "𐑑", "у": "𐑪", "ў": "𐑘", "в": "𐑝", "з": "𐑟" },
		ShavianToEsperanto: { "𐑨": "a", "𐑚": "b", "𐑔": "c", "𐑗": "ĉ", "𐑛": "d", "𐑧": "e", "𐑓": "f", "𐑜": "g", "𐑡": "ĝ", "𐑣": "h", "𐑙": "ĥ", "𐑦": "i", "𐑢": "j", "𐑠": "ĵ", "𐑒": "k", "𐑤": "l", "𐑫": "m", "𐑵": "n", "𐑩": "o", "𐑐": "p", "𐑮": "r", "𐑕": "s", "𐑖": "ŝ", "𐑑": "t", "𐑪": "u", "𐑘": "ŭ", "𐑝": "v", "𐑟": "z" },
		ShavianToCyrillic: { "𐑨": "а", "𐑚": "б", "𐑔": "ц", "𐑗": "ч", "𐑛": "д", "𐑧": "е", "𐑓": "ф", "𐑜": "г", "𐑡": "џ", "𐑣": "һ", "𐑙": "х", "𐑦": "и", "𐑢": "ј", "𐑠": "ж", "𐑒": "к", "𐑤": "л", "𐑫": "м", "𐑵": "н", "𐑩": "о", "𐑐": "п", "𐑮": "р", "𐑕": "с", "𐑖": "ш", "𐑑": "т", "𐑪": "у", "𐑘": "ў", "𐑝": "в", "𐑟": "з" },
		EsperantoToBulgarian: { "A": "А", "B": "Б", "C": "Ц", "Ĉ": "Ч", "D": "Д", "E": "Е", "F": "Ф", "G": "Г", "Ĝ": "ДЖ", "H": "Х", "Ĥ": "Х", "I": "И", "J": "Й", "Ĵ": "Ж", "K": "К", "L": "Л", "M": "М", "N": "Н", "O": "О", "P": "П", "R": "Р", "S": "С", "Ŝ": "Ш", "T": "Т", "U": "У", "Ŭ": "У", "V": "В", "Z": "З", "a": "а", "b": "б", "c": "ц", "ĉ": "ч", "d": "д", "e": "е", "f": "ф", "g": "г", "ĝ": "дж", "h": "х", "ĥ": "х", "i": "и", "j": "й", "ĵ": "ж", "k": "к", "l": "л", "m": "м", "n": "н", "o": "о", "p": "п", "r": "р", "s": "с", "ŝ": "ш", "t": "т", "u": "у", "ŭ": "у", "v": "в", "z": "з" },
		EsperantoToCyrillic: { "A": "А", "B": "Б", "C": "Ц", "Ĉ": "Ч", "D": "Д", "E": "Е", "F": "Ф", "G": "Г", "Ĝ": "Џ", "H": "Һ", "Ĥ": "Х", "I": "И", "J": "Ј", "Ĵ": "Ж", "K": "К", "L": "Л", "M": "М", "N": "Н", "O": "О", "P": "П", "R": "Р", "S": "С", "Ŝ": "Ш", "T": "Т", "U": "У", "Ŭ": "Ў", "V": "В", "Z": "З", "a": "а", "b": "б", "c": "ц", "ĉ": "ч", "d": "д", "e": "е", "f": "ф", "g": "г", "ĝ": "џ", "h": "һ", "ĥ": "х", "i": "и", "j": "ј", "ĵ": "ж", "k": "к", "l": "л", "m": "м", "n": "н", "o": "о", "p": "п", "r": "р", "s": "с", "ŝ": "ш", "t": "т", "u": "у", "ŭ": "ў", "v": "в", "z": "з" },
		EsperantoToShavian: { "A": "𐑨", "B": "𐑚", "C": "𐑔", "Ĉ": "𐑗", "D": "𐑛", "E": "𐑧", "F": "𐑓", "G": "𐑜", "Ĝ": "𐑡", "H": "𐑣", "Ĥ": "𐑙", "I": "𐑦", "J": "𐑢", "Ĵ": "𐑠", "K": "𐑒", "L": "𐑤", "M": "𐑫", "N": "𐑵", "O": "𐑩", "P": "𐑐", "R": "𐑮", "S": "𐑕", "Ŝ": "𐑖", "T": "𐑑", "U": "𐑪", "Ŭ": "𐑘", "V": "𐑝", "Z": "𐑟", "a": "𐑨", "b": "𐑚", "c": "𐑔", "ĉ": "𐑗", "d": "𐑛", "e": "𐑧", "f": "𐑓", "g": "𐑜", "ĝ": "𐑡", "h": "𐑣", "ĥ": "𐑙", "i": "𐑦", "j": "𐑢", "ĵ": "𐑠", "k": "𐑒", "l": "𐑤", "m": "𐑫", "n": "𐑵", "o": "𐑩", "p": "𐑐", "r": "𐑮", "s": "𐑕", "ŝ": "𐑖", "t": "𐑑", "u": "𐑪", "ŭ": "𐑘", "v": "𐑝", "z": "𐑟" },
		EsperantoToXSystem: { "Ĉ": "Cx", "Ĝ": "Gx", "Ĥ": "Hx", "Ĵ": "Jx", "Ŝ": "Sx", "Ŭ": "Ux", "ĉ": "cx", "ĝ": "gx", "ĥ": "hx", "ĵ": "jx", "ŝ": "sx", "ŭ": "ux" },
		XSystemToEsperanto: { "CX": "Ĉ", "GX": "Ĝ", "HX": "Ĥ", "JX": "Ĵ", "SX": "Ŝ", "UX": "Ŭ", "Cx": "Ĉ", "Gx": "Ĝ", "Hx": "Ĥ", "Jx": "Ĵ", "Sx": "Ŝ", "Ux": "Ŭ", "cx": "ĉ", "gx": "ĝ", "hx": "ĥ", "jx": "ĵ", "sx": "ŝ", "ux": "ŭ" }
	},
	convert: (function () {

		function convert_r(input, m) {
			var output = input
			var marr = Object.entries(m)
			for (var i = 0; i < marr.length; i++) {
				var mel = marr[i]
				output = output.replaceAll(mel[0], mel[1])
			}
			return output
		}

		return function (input, m, r) {
			if (r) {
				return convert_r(input, m)
			}
			var output = []
			for (var i = 0; i < input.length; i++) {
				var xx = input.charAt(i)
				var mxx = m[xx]
				if (mxx != undefined) {
					xx = mxx
				}
				output.push(xx)
			}
			return output.join("")
		}

	})()
}
